Repository: tommikaikkonen/django-twoscoops-heroku-s3
Catalog: project_name/locale/*/LC_MESSAGES/django.po
Languages: fi

source: A user with that email address already exists.
fi: Käyttäjä on jo olemassa kyseisellä sähköpostiosoitteella.

source: The two password fields didn't match.
fi: Salasanat eivät täsmänneet

source: The password must be longer than 4 characters
fi: Salasanan pitää olla neljää merkkiä pidempi.

source: Password
fi: Salasana

source: Password confirmation
fi: Salasana uudestaan

source: Enter the same password as above, for verification.
fi: Kirjoita sama salana kuin yläpuolella varmistukseksi.

source: Raw passwords are not stored, so there is no way to see this user's password, but you can change the password using <a href="password/">this form</a>.
fi: ddd

source: Old password
fi: Vanha salasana

source: If you want to change your password, fill out the remaining fields
fi: Jos haluat muuttaa salasanasi, täytä loput kentät

source: New password
fi: Uusi salasana

source: New password confirmation
fi: Uuden salasanan varmistus

source: email address
fi: sähköpostiosoite

source: first name
fi: etunimi

source: last name
fi: sukunimi

# action
source: Edit Profile
fi: Muokkaa profiilia

# action
source: Log out
fi: Kirjaudu ulos

source: Sign up
fi: Rekisteröidy

source: Log in
fi: Kirjaudu sisään

# title
source: Edit profile
fi: Muokkaa profiilia

# action
source: Save changes
fi: Tallenna muutokset

source: Activation complete
fi: Aktivointi valmis

source: Activation problem
fi: Aktivoinnissa ongelma

source: Thanks %(account)s, activation complete! You may now <a href='%(auth_login_url)s'>login</a> using the username and password you set at registration.
fi: Kiitos %(account)s, aktivointi on valmis! Voit nyt <a href='%(auth_login_url)s'>kirjautua sisään sähköpostiosoitteella ja salasanallasi, joita käytit rekisteröitymiseen.</a>

source: Oops &ndash; it seems that your activation key is invalid. Please check the url again.
fi: Aktivointikoodisi ei ole oikein. Tarkasta osoite uudelleen.

# title
source: Activation complete
fi: Aktivointi valmis

source: Thanks, activation complete! You may now <a href='%(auth_login_url)s'>login</a> using the username and password you set at registration.
fi: Kiitos, aktivointi on valmis! Voit nyt <a href='%(auth_login_url)s'>kirjautua sisään</a> sähköpostiosoitteella ja salasanallasi, joita käytit rekisteröitymiseen.

source: You (or someone pretending to be you) have asked to register an account at %(site.name)s. If this wasn't you, please ignore this email and your address will be removed from our records.
fi: Pyysitte tunnuksien rekisteröintiä sivustolla %(site.name)s. Jos ette pyytänyt tätä, voitte jättää tämän sähköpostin huomiotta.

source: To activate this account, please click the following link within the next %(expiration_days)s days:
fi: Aktivoidaksenne tunnukset, klikatkaa seuraavaa linkkiä %(expiration_days)s päivän kuluessa:

source: Sincerely, %(site.name)s Management
fi: Terveisin, %(site.name)s

# email_subject
source: Account registration for %(site.name)s
fi: Tunnuksien rekisteröinti sivustolle %(site.name)s

source: Oops! There were errors processing your form.
fi: Oho! Emme jostain syystä pystyneet käsittelemään lomaketta.

# title
source: Login
fi: Kirjaudu sisään

# page_title
source: Login
fi: Kirjaudu sisään

source: Forgot your password?
fi: Unohditko salasanan?

source: Need an account?
fi: Tarvitsetko tunnukset?

source: Login
fi: Kirjaudu sisään

# title
source: Logged out
fi: Kirjautunut ulos

source: Successfully logged out!
fi: Kirjauduit onnistuneesti ulos!

source: Password changed
fi: Salasana muutettu

source: Password successfully changed!
fi: Salasana vaihdettu onnistuneesti!

# title
source: Change password
fi: Vaihda salasanaa

# action
source: Change password
fi: Vaihda salasana

# title
source: Password reset complete
fi: Salasanan uudelleenasetus valmis

# title
source: Confirm password reset
fi: Vahvista salasanan uudelleenasetus

source: Enter your new password below to reset your password
fi: Kirjoita uusi salasanasi alle

# action
source: Set password
fi: Aseta salasana

# title
source: Password reset
fi: Aseta salasana uudelleen

source: We have sent you an email with a link to reset your password. Please check your email and click the link to continue.
fi: Sähköpostiisi on lähetetty aktivointiviesti. Tarkista sähköpostisi ja klikkaa linkkia aktivoidaksesi tunnukset.

# Email greeting followed by username
source: Greetings
fi: Hei

source: You are receiving this email because you (or someone pretending to be you) requested that your password be reset on the %(domain)s site. If you do not wish to reset your password, please ignore this message.
fi: Sait tämän viestin, koska pyysit salasanasi uudelleenasetusta sivustolla %(domain)s. Jos et halua asettaa salasanaasi uudelleen, tai et pyytänyt sitä, voit jättää tämän viestin huomiotta.

source: Your username, in case you've forgotten:
fi: Käyttäjätunnuksesi on:

source: Best regards, %(site_name)s Management
fi: Terveisin, %(site_name)s

# title
source: Reset password
fi: Aseta salasana udelleen

source: Forgot your password? Enter your email in the form below and we'll send you instructions for creating a new one.
fi: Unohditko salasanasi? Kirjoita sähköpostiosoitteesi ja lähetämme sinne ohjeet uuden salasanan saamiseen

# action
source: Reset password
fi: Aseta salasana uudelleen

source: Activation email sent
fi: Aktivointiviesti lähetetty sähköpostiin

source: An activation email has been sent. Please check your email and click on the link to activate your account.
fi: Sähköpostiisi on lähetetty aktivointiviesti. Tarkista sähköpostisi ja klikkaa linkkia aktivoidaksesi tunnukset.

# title
source: Register for an account
fi: Rekisteröidy

source: Send activation email
fi: Lähetä aktivointiviesti sähköpostiin
